In [1]:
import pandas as pd

**Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.**

In [2]:
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

**Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.**

In [3]:
data = [i for i in range(10, 101, 10)]
series = pd.Series(data)
series

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

**Q3. Create a Pandas DataFrame that contains the following data:**

In [4]:
data = {
    'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25, 30, 27],
    'Gender' : ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

**Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.**

A4.

**DataFrame:**

- A DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure in pandas.
- It can be thought of as a table or a spreadsheet, where data is organized in rows and columns.
- Each column in a DataFrame can be of different data types (e.g., integers, floats, strings).
- A DataFrame has both row and column labels (indexes), which make it easier to manipulate and access data.

**Series:**

- A Series is a one-dimensional, size-mutable, and homogeneous data structure in pandas.
- It can be thought of as a single column of data.
- Each element in a Series is indexed with labels, which can be used to access individual elements.
- A Series is essentially a single column of a DataFrame with an index.

**Key Differences:**

- Dimensionality:

    - DataFrame: Two-dimensional (rows and columns).
    - Series: One-dimensional (single column).

- Data Structure:

    - DataFrame: Table-like structure with multiple columns, each of which can have different data types.
    - Series: Single column with a single data type.

- Usage:

    - DataFrame: Used for tabular data with multiple attributes.
    - Series: Used for a single attribute or column of data.

In [5]:
# Example:

data = {
    'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25, 30, 27],
    'Gender' : ['Female', 'Male', 'Female']
}


df = pd.DataFrame(data)
print('This is a Data Frame:')
print(df, '\n')

series = pd.Series(data[list(data.keys())[0]])
print('This is a Series:')
print(series)

This is a Data Frame:
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

This is a Series:
0     Alice
1       Bob
2    Claire
dtype: object

**Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?**

In [6]:
data = {
    'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25, 30, 27],
    'Gender' : ['Female', 'Male', 'Female']
}

### head()

In [7]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### tail()

In [8]:
df.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### sort_values()

In [9]:
df.sort_values(by= 'Age', ascending= False)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female
0   Alice   25  Female

In [10]:
df.drop(index= [1,2])

    Name  Age  Gender
0  Alice   25  Female

**Q6. Which of the following is mutable in nature Series, DataFrame, Panel?**

A6. 

- **Series:** Pandas Series is mutable. You can change the values of individual elements, add new elements, or modify existing ones.
- **DataFrame:** Pandas DataFrame is also mutable. You can modify values, add or remove columns and rows, and perform other changes.
- **Panel:** Panel data structure was used in earlier versions of Pandas but is now deprecated and removed in the latest versions (starting from Pandas 1.0). While it was mutable when it was available, it is recommended to use MultiIndex DataFrames for similar functionality.

**Q7. Create a DataFrame using multiple Series. Explain with an example.**

In [11]:
series_1 = pd.Series(data[list(data.keys())[0]], name= 'Name')
series_2 = pd.Series(data[list(data.keys())[1]], name= 'Age')

print('Series 1:')
print(series_1, '\n')

print('Series 2:')
print(series_2, '\n')

df = pd.concat([series_1, series_2], axis= 1)
df

Series 1:
0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

Series 2:
0    25
1    30
2    27
Name: Age, dtype: int64

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27